database = {
    "000000": "Алексеев Тимофей",
    "000001": "Белисов Глеб",
    "000100": "Язев Григорий",
    "000101": "Царёв Александр",
    "001001": "Абдулов Илья",
    "001010": "Миляев Дмитрий",
    "001101": "Конопля Алексей",
    "001110": "Шишминцев Дмитрий",

    "010000": "Телунц Эдуард",
    "010001": "Комелин Глеб",
    "010101": "Горлов Игорь",
    "010100": "Смирнов Игорь",
    "010110": "Бабаев Руслан",
    "010111": "Оншин Дмитрий",
    "011001": "Кабдулвахитов Эмир",
    "011010": "Затикян Серей",
    "011110": "Шестаков Максим",

    "100010": "Адрат Олеся",
    "100100": "Садовая Анастасия",
    "101000": "Шаллиева Вера",
    "101100": "Кремпольская Екатерина",
    "101110": "Петрова Наталья",
    "110110": "Касьяненко Вера",
    "111000": "Боженко Мария",
    "111011": "Авокадо Ева",
    "111100": "Надери Мариам"
}

a = ''  # ключ для словаря
print("Загадайте студента из группы К3121")
print('Отвечайте на вопросы только Да/Нет')

question = input('Это девушка?')
if question == 'да':
    a = '1'
elif question == 'нет':
    a = '0'
else:
    print('Неправильный формат ответа')
    exit()
question = input('У вашего студента тёмные волосы?')
if question == 'да':
    a = a + '1'
elif question == 'нет':
    a = a + '0'
else:
    print('неправильный формат ответа')
    exit()
question = input('Этот студент носит очки?')
if question == 'да':
    a = a + '1'
elif question == 'нет':
    a = a + '0'
else:
    print('неправильный формат ответа')
    exit()

question = input('Этот студент родился зимой или весной?')
if question == 'да':
    a = a + '1'
elif question == 'нет':
    a = a + '0'
else:
    print('неправильный формат ответа')
    exit()

question = input('У этого студента есть вторая половинка?')
if question == 'да':
    a = a + '1'
elif question == 'нет':
    a = a + '0'
else:
    print('неправильный формат ответа')
    exit()

question = input('Этот студент играет в CS:GO или Dota 2?')
if question == 'да':
    a = a + '1'
elif question == 'нет':
    a = a + '0'
else:
    print('неправильный формат ответа')

if a in database:
    print('Вы загадали студента по имени', database[a])
else:
    print('В группе К3121 нет загаданного вами студента')
